NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32FG22/EFR32FG22C121F512GM40.svd
<?xml version="1.0" encoding="UTF-8"?>
<device>
  <vendor>Silicon Labs</vendor>
  <vendorID>SLAB</vendorID>
  <name>EFR32FG22C121F512GM40</name>
  <series>EFR32</series>
  <version>C</version>
  <description>Flex Gecko 38.4 MHz, 6dBm, Proprietary</description>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0</resetValue>
  <resetMask>4294967295</resetMask>
  <peripherals>
    <peripheral>
      <name>EMU_S</name>
      <version>1</version>
      <description>EMU_S Registers</description>
      <baseAddress>0x40004000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EMU</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>EMUDG</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>EMUSE</name>
        <value>30</value>
      </interrupt>
      <registers>
        <register>
          <name>DECBOD</name>
          <description>No Description</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000022</resetValue>
          <resetMask>0x00000033</resetMask>
          <fields>
            <field>
              <name>DECBODEN</name>
              <description>DECBOD enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECBODMASK</name>
              <description>DECBOD Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECOVMBODEN</name>
              <description>Over Voltage Monitor enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DECOVMBODMASK</name>
              <description>Over Voltage Monitor Mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BOD3SENSE</name>
          <description>No Description</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000077</resetMask>
          <fields>
            <field>
              <name>AVDDBODEN</name>
              <description>AVDD BOD enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDIO0BODEN</name>
              <description>VDDIO0 BOD enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDDIO1BODEN</name>
              <description>VDDIO1 BOD enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VREGVDDCMPCTRL</name>
          <description>No Description</description>
          <addressOffset>0x03C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <resetMask>0x00000007</resetMask>
          <fields>
            <field>
              <name>VREGINCMPEN</name>
              <description>VREGVDD comparator enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESSEL</name>
              <description>VREGVDD comparator threshold programming</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PD1PARETCTRL</name>
          <description>No Description</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>PD1PARETDIS</name>
              <description>Disable PD1 Partial Retention </description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RETAIN</name>
                  <description>Retain associated registers when in EM2/3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORETAIN</name>
                  <description>Do not retain associcated registers when in EM2/3</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCK</name>
          <description>No Description</description>
          <addressOffset>0x060</addressOffset>
          <access>write-only</access>
          <resetValue>0x0000ADE8</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>LOCKKEY</name>
              <description>Lock Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCK</name>
                  <description>Unlock EMU register</description>
                  <value>44520</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>No Description</description>
          <addressOffset>0x064</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xEB070000</resetMask>
          <fields>
            <field>
              <name>AVDDBOD</name>
              <description>AVDD BOD Interrupt flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOVDD0BOD</name>
              <description>VDDIO0 BOD Interrupt flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM23WAKEUP</name>
              <description>EM23 Wake up Interrupt flag</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSCALEDONE</name>
              <description>Vscale done Interrupt flag</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMPAVG</name>
              <description>Temperature Average Interrupt flag</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMP</name>
              <description>Temperature Interrupt flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMPLOW</name>
              <description>Temperature low Interrupt flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMPHIGH</name>
              <description>Temperature high Interrupt flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x068</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xEB070000</resetMask>
          <fields>
            <field>
              <name>AVDDBOD</name>
              <description>AVDD BOD Interrupt enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOVDD0BOD</name>
              <description>VDDIO0 BOD Interrupt enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM23WAKEUP</name>
              <description>EM23 Wake up Interrupt enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSCALEDONE</name>
              <description>Vscale done Interrupt enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMPAVG</name>
              <description>Temperature Interrupt enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMP</name>
              <description>Temperature Interrupt enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMPLOW</name>
              <description>Temperature low Interrupt enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMPHIGH</name>
              <description>Temperature high Interrupt enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EM4CTRL</name>
          <description>No Description</description>
          <addressOffset>0x06C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000133</resetMask>
          <fields>
            <field>
              <name>EM4ENTRY</name>
              <description>EM4 entry request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM4IORETMODE</name>
              <description>EM4 IO retention mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No Retention: Pads enter reset state when entering EM4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EM4EXIT</name>
                  <description>Retention through EM4: Pads enter reset state when exiting EM4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWUNLATCH</name>
                  <description>Retention through EM4 and Wakeup: software writes UNLATCH register to remove retention</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BOD3SENSEEM4WU</name>
              <description>Set BOD3SENSE as EM4 wakeup</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD</name>
          <description>No Description</description>
          <addressOffset>0x070</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00020E12</resetMask>
          <fields>
            <field>
              <name>EM4UNLATCH</name>
              <description>EM4 unlatch</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TEMPAVGREQ</name>
              <description>Temperature Average Request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EM01VSCALE1</name>
              <description>Scale voltage to Vscale1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>EM01VSCALE2</name>
              <description>Scale voltage to Vscale2 </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RSTCAUSECLR</name>
              <description>Reset Cause Clear</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>No Description</description>
          <addressOffset>0x074</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0xE0010309</resetMask>
          <fields>
            <field>
              <name>EM2DBGEN</name>
              <description>Enable debugging in EM2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMPAVGNUM</name>
              <description>Averaged Temperature samples num</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>N16</name>
                  <description>16 measurements</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N64</name>
                  <description>64 measurements</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EM23VSCALE</name>
              <description>EM2/EM3 Vscale </description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSCALE0</name>
                  <description>VSCALE0. 0.9v</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSCALE1</name>
                  <description>VSCALE1. 1.0v</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSCALE2</name>
                  <description>VSCALE2. 1.1v</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLASHPWRUPONDEMAND</name>
              <description>Enable flash on demand wakeup</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFPDIRECTMODEEN</name>
              <description>EFP Direct Mode Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFPDRVDECOUPLE</name>
              <description>EFP drives DECOUPLE</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EFPDRVDVDD</name>
              <description>EFP drives DVDD</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEMPLIMITS</name>
          <description>No Description</description>
          <addressOffset>0x078</addressOffset>
          <access>read-write</access>
          <resetValue>0x01FF0000</resetValue>
          <resetMask>0x01FF01FF</resetMask>
          <fields>
            <field>
              <name>TEMPLOW</name>
              <description>Temp Low limit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TEMPHIGH</name>
              <description>Temp High limit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>No Description</description>
          <addressOffset>0x084</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000080</resetValue>
          <resetMask>0xFF0054FF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UNLOCKED</name>
                  <description>All EMU lockable registers are unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCKED</name>
                  <description>All EMU lockable registers are locked.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIRSTTEMPDONE</name>
              <description>First Temp done</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEMPACTIVE</name>
              <description>Temp active</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEMPAVGACTIVE</name>
              <description>Temp Average active</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSCALEBUSY</name>
              <description>Vscale busy</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSCALEFAILED</name>
              <description>Vscale failed</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSCALE</name>
              <description>Vscale status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSCALE0</name>
                  <description>Voltage scaling set to 0.9v</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSCALE1</name>
                  <description>Voltage scaling set to 1.0v</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSCALE2</name>
                  <description>Voltage scaling set to 1.1v</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RACACTIVE</name>
              <description>RAC active</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EM4IORET</name>
              <description>EM4 IO retention status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EM2ENTERED</name>
              <description>EM2 entered</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
