NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32FG22/EFR32FG22C121F512GM40.svd
        <register>
          <name>IEN</name>
          <description>No Description</description>
          <addressOffset>0x06C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7F7FFFFF</resetMask>
          <fields>
            <field>
              <name>TXDONE</name>
              <description>TX Done Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXAFTERFRAMEDONE</name>
              <description>TX after frame Done Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXABORTED</name>
              <description>Transmit Aborted Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXUF</name>
              <description>Transmit Underflow Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXDONE</name>
              <description>RX Done Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXABORTED</name>
              <description>RX Aborted Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAMEERROR</name>
              <description>Frame Error Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLOCKERROR</name>
              <description>Block Error Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOF</name>
              <description>Receive Overflow Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WCNTCMP0</name>
              <description>Word Counter Compare 0 Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WCNTCMP1</name>
              <description>Word Counter Compare 1 Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WCNTCMP2</name>
              <description>Word Counter Compare 2 Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRERROR</name>
              <description>Receive address error enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSERROR</name>
              <description>Bus error enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRAWEVENT</name>
              <description>Receiver raw data enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXRAWEVENT</name>
              <description>Transmit raw data enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFOF</name>
              <description>Data sniffer overflow enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WCNTCMP3</name>
              <description>Word Counter Compare 3 Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WCNTCMP4</name>
              <description>Word Counter Compare 4 Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOISET</name>
              <description>BOISET</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTBUFSTART</name>
              <description>PKTBUFSTART Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKTBUFTHRESHOLD</name>
              <description>PKTBUFTHRESHOLD Enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRAWOF</name>
              <description>RXRAWOF Enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAMEDETPAUSED</name>
              <description>Frame detected pause event enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERLEAVEWRITEPAUSED</name>
              <description>Interleaver write pause event enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERLEAVEREADPAUSED</name>
              <description>Interleaver read pause event enable</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSUBFRAMEPAUSED</name>
              <description>Transmit subframe pause event enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONVPAUSED</name>
              <description>Convolutional coder pause event enable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXWORD</name>
              <description>Receive Word Interrupt Enable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXWORD</name>
              <description>Transmit Word Interrupt Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OTACNT</name>
          <description>No Description</description>
          <addressOffset>0x070</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OTARXCNT</name>
              <description>OTA RX bit counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OTATXCNT</name>
              <description>OTA TX bit counter</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BUFFERMODE</name>
          <description>No Description</description>
          <addressOffset>0x078</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>TXBUFFERMODE</name>
              <description>Transmit Buffer Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFC</name>
                  <description>The Frame Controller fetches data from the Buffer Controller (BUFC) in transmit mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REGISTER</name>
                  <description>The Frame Controller does not fetch data from the Buffer Controller in transmit mode.   Instead, data must be written to the DATABUFFER register when the TXWORD interrupt flag is set.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXBUFFERMODE</name>
              <description>Receive Buffer Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFC</name>
                  <description>The Frame Controller write data to the Buffer Controller (BUFC) in receive mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REGISTER</name>
                  <description>The Frame Controller does not write data to the Buffer Controller in receive mode.   Instead, data must be read from the DATABUFFER register when the RXWORD interrupt flag is set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>The Frame Controller will not output demodulated data. This mode can, for instance, be used together  with storing RAW frame data.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXFRCBUFMUX</name>
              <description>RX FRC Buffer Mux</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SNIFFCTRL</name>
          <description>No Description</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x000007FC</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>SNIFFMODE</name>
              <description>Data Sniff Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>FRC Packet Sniffer mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART</name>
                  <description>UART encoded data is transmitted on the DOUT pin.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI</name>
                  <description>SPI data is transmitted on the DOUT pin and a data clock is output to the DCLK pin.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNIFFBITS</name>
              <description>Data sniff data bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>Each sniffer output word contains 8 data bits</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NINE</name>
                  <description>Each sniffer output word contains 9 data bits</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNIFFRXDATA</name>
              <description>Enable sniffing of received data.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFTXDATA</name>
              <description>Enable sniffing of transmitted data.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFRSSI</name>
              <description>Enable sniffing of RSSI</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFSTATE</name>
              <description>Enable sniffing of state information</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFAUXDATA</name>
              <description>Enable sniffing of auxiliary data</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFBR</name>
              <description>Sniffer baudrate setting</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNIFFSYNCWORD</name>
              <description>Sniffer baudrate setting</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUXDATA</name>
          <description>No Description</description>
          <addressOffset>0x088</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>AUXDATA</name>
              <description>Auxiliary sniffer data output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RAWCTRL</name>
          <description>No Description</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000021BF</resetMask>
          <fields>
            <field>
              <name>TXRAWMODE</name>
              <description>Transmitter raw data mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>RAW transmit mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEBUFFER</name>
                  <description>RAW transmit mode is enabled, transmitting the configured raw data (fetched from RAM) once before transmit is completed.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATBUFFER</name>
                  <description>RAW transmit mode is enabled, transmitting the configured raw data (fetched from RAM) repeatedly until the transmitter is disabled.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXRAWMODE</name>
              <description>Receiver raw data mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>RAW receive mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEITEM</name>
                  <description>RAW receive mode is enabled, fetching a single item which is stored in the RXRAWDATA register. A new item is  fetched when the RXRAWBLOCKED flag is cleared. In this mode, the flag is cleared automatically when RXRAWDATA is read.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEBUFFER</name>
                  <description>RAW receive mode is enabled, fetching multiple items which are stored to RAM. The RXRAWBLOCKED flag must be cleared  in order to start raw data reception.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLEBUFFERFRAME</name>
                  <description>This mode is identical to the SINGLEBUFFER mode, except that the FRC will treat the end of the filled buffer  as the end of a frame reception (i.e. also trigger the RXDONE interrupt and signal to the RAC that frame reception   is complete.)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATBUFFER</name>
                  <description>RAW receive mode is enabled, fetching multiple items which are stored to RAM. The RXRAWBLOCKED flag must be cleared  in order to start raw data reception.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXRAWRANDOM</name>
              <description>Receive raw data random number generator</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXRAWTRIGGER</name>
              <description>Receiver raw data trigger setting</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>RAW data storage is triggered immediately when demodulator is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRS</name>
                  <description>RAW data storage is triggered by the selected RXRAWPRSSEL PRS channel.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNALSIG</name>
                  <description>RAW data storage is triggered by an internal signal</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEMODRAWDATAMUX</name>
              <description>Raw data mux control</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEMODRAWDATASEL</name>
                  <description>RAW data is selected using modem register DEMODRAWDATASEL.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEMODRAWDATASEL2</name>
                  <description>RAW data is selected using modem register DEMODRAWDATASEL2.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXRAWDATA</name>
          <description>No Description</description>
          <addressOffset>0x090</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXRAWDATA</name>
              <description>Receiver RAW data register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAUSEDATA</name>
          <description>No Description</description>
          <addressOffset>0x094</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PAUSEDATA</name>
              <description>Receiver pause data register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
